.cf.xml/InformationRegisters/обм_Измененные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>обм_Измененные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияДанных</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_ВерсияДанных</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УзелОтправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_категория</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_ид</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ФлагОшибкиПриОбработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

.cf.xml/InformationRegisters/обм_Измененные/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
Процедура Зарегистрировать(пИсточникСсылка, пУзелОтправитель = Неопределено, пКатегория = Неопределено, пИдентификатор = Неопределено) Экспорт

	запись = РегистрыСведений.обм_Измененные.СоздатьМенеджерЗаписи();

	запись.Ссылка = пИсточникСсылка;
	запись.ДатаВремя = общ.ДатаУниверсальная();
	запись.ВерсияДанных = пИсточникСсылка.ВерсияДанных;
	запись.УзелОтправитель = пУзелОтправитель;
	запись.Категория = пКатегория;
	запись.Идентификатор = пИдентификатор;
	
	УстановитьПривилегированныйРежим(Истина);
	запись.Записать(Истина);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура КОтправке(пИсточникСсылка, пВерсияДанных, пУдалитьРегистрацию = Истина) Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		исходящиеСообщения = Справочники.обм_ИсходящиеСообщения.СоздатьПоСсылкеИсточника(пИсточникСсылка);
					
		Справочники.обм_ИсходящиеСообщения.ЗарегистрироватьКОтправке(исходящиеСообщения);

		Если пУдалитьРегистрацию Тогда
			РегистрыСведений.обм_Измененные.УдалитьРегистрацию(пИсточникСсылка, пВерсияДанных);
				
		КонецЕсли;
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		РегистрыСведений.обм_Измененные.ПоднятьФлагОшибки(пИсточникСсылка, пВерсияДанных);
		ВызватьИсключение;
		
	КонецПопытки;

КонецПроцедуры

Процедура ПоднятьФлагОшибки(пИсточник, пВерсияДанных = Неопределено) Экспорт
	
	источникСсылка = общ.Ссылка_ПоОбъекту(пИсточник);

	Если Не общ.ЭтоЗаполненнаяСсылка(источникСсылка) Тогда
		Возврат;
		
	КонецЕсли;
	
	блокировка = Новый БлокировкаДанных;
	имяТаблицы = общ.Объект_ИмяТаблицы(Метаданные.РегистрыСведений.обм_Измененные);
	блокЭлемент = блокировка.Добавить(имяТаблицы);
	блокЭлемент.Режим = РежимБлокировкиДанных.Исключительный;
	блокЭлемент.УстановитьЗначение("Ссылка", источникСсылка);
	
	НачатьТранзакцию();
	Попытка
		блокировка.Заблокировать();
		запись = РегистрыСведений.обм_Измененные.СоздатьМенеджерЗаписи();
		запись.Ссылка = источникСсылка;
		запись.Прочитать();
		
		// Контроль версии данных
		версияИзменилась = Не ПустаяСтрока(пВерсияДанных) И запись.Выбран() И запись.ВерсияДанных <> пВерсияДанных;
		
		Если Не версияИзменилась Тогда
			запись.ФлагОшибкиПриОбработке = Истина;
			запись.ВерсияДанных = пВерсияДанных;
			запись.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Иначе
			ОтменитьТранзакцию();
			
		КонецЕсли;
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;

КонецПроцедуры

Процедура УдалитьРегистрацию(пИсточник, пВерсияДанных = Неопределено) Экспорт

	источникСсылка = общ.Ссылка_ПоОбъекту(пИсточник);

	Если Не общ.ЭтоЗаполненнаяСсылка(источникСсылка) Тогда
		Возврат;
		
	КонецЕсли;
	
	блокировка = Новый БлокировкаДанных;
	имяТаблицы = общ.Объект_ИмяТаблицы(Метаданные.РегистрыСведений.обм_Измененные);
	блокЭлемент = блокировка.Добавить(имяТаблицы);
	блокЭлемент.Режим = РежимБлокировкиДанных.Исключительный;
	блокЭлемент.УстановитьЗначение("Ссылка", источникСсылка);
	
	НачатьТранзакцию();
	Попытка
		блокировка.Заблокировать();
		запись = РегистрыСведений.обм_Измененные.СоздатьМенеджерЗаписи();
		запись.Ссылка = источникСсылка;
	
		// Контроль версии данных, если она передана в параметре
		Если Не ПустаяСтрока(пВерсияДанных) Тогда
			запись.Прочитать();
		
			// Удалять только если версия данных не изменилась
			Если запись.Выбран() И запись.ВерсияДанных = пВерсияДанных Тогда
				запись.Удалить();
				
			КонецЕсли;
			
		Иначе // ПустаяСтрока(пВерсияДанных)
			запись.Удалить();
			
		КонецЕсли; 
	
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбработатьтОчередьИзмененных() Экспорт

	имяСобытия = ИмяСобытияЖурналаРегистрации("Отправка.ИсходящиеСообщения.Создать");
	
	запрос = Новый Запрос;
	запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 100
	|	Т.Ссылка КАК Ссылка,
	|	Т.ВерсияДанных КАК ВерсияДанных
	|ИЗ
	|	РегистрСведений.обм_Измененные КАК Т
	|ГДЕ
	|	Т.ФлагОшибкиПриОбработке = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.ДатаВремя";
	
	Пока Истина Цикл
		выборка = запрос.Выполнить().Выбрать();
		
		Если выборка.Количество() = 0 Тогда
			Прервать;
			
		КонецЕсли;
		
		Пока выборка.Следующий() Цикл
			Попытка
				РегистрыСведений.обм_Измененные.КОтправке(выборка.Ссылка, выборка.ВерсияДанных);
				
			Исключение
				// Ошибку записать в журнал, но обработку не прерывать.
				// Сбой на одном элементе не должен останавливать процесс
				имяСобытия = обм.ИмяСобытияЖурналаРегистрации("Отправка.ОбработатьОчередьИзмененных");
				общ.Ошибка_ВЖурналРегистрации(имяСобытия, ИнформацияОбОшибке(), выборка.Ссылка);
				
			КонецПопытки;
			
		КонецЦикла;
		Выборка.Сбросить();
		
	КонецЦикла; // Пока Истина
	
КонецПроцедуры

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Процедура ПоднятьФлагОшибки(пИсточникСсылка)
	
	ВызватьИсключение "НеРеализовано";

КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли // #Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
